back-end/app/controllers/snippets_controller.rb

SELECT "snippets".* FROM "snippets"
---
  def index
    @snippets = Snippet.all